project_rails/blogger/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Test from Create New Article"], ["created_at", "2016-02-18 16:49:41.874233"], ["updated_at", "2016-02-18 16:49:41.874233"]]
---
	def create
# 	best - You need to go to helper.rb to set article_params
# 			you will need to use 'include ArticlesHelper'
		@article = Article.new(article_params)
		@article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "body" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?
---
	def update
		@article = Article.find(params[:id])
		@article.update(article_params)