project_rails/blogger/app/controllers/authors_controller.rb

INSERT INTO "authors" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "admin"], ["email", "admin@example.com"], ["created_at", "2016-02-22 18:30:49.307083"], ["updated_at", "2016-02-22 18:30:49.307083"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE "authors" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["salt", "RKy8CpnCwKxjqVvvpzAF"], ["crypted_password", "$2a$10$e3QQz603w3UoSrA.gdDRfup6pyYi48.cASEwQ9ff.gkqI/W6F/SJG"], ["updated_at", "2016-02-22 19:36:18.981976"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)